efenocchi/STM32-new_project/Core/Src/main.c
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */


static void VL53L0X_PROXIMITY_Init(void)
{
  uint16_t vl53l0x_id = 0;
  VL53L0X_DeviceInfo_t VL53L0X_DeviceInfo;

  /* Initialize IO interface */
  SENSOR_IO_Init();
  VL53L0X_PROXIMITY_MspInit();

  memset(&VL53L0X_DeviceInfo, 0, sizeof(VL53L0X_DeviceInfo_t));

  if (VL53L0X_ERROR_NONE == VL53L0X_GetDeviceInfo(&Dev, &VL53L0X_DeviceInfo))
  {
    if (VL53L0X_ERROR_NONE == VL53L0X_RdWord(&Dev, VL53L0X_REG_IDENTIFICATION_MODEL_ID, (uint16_t *) &vl53l0x_id))
    {
      if (vl53l0x_id == VL53L0X_ID)
      {
        if (VL53L0X_ERROR_NONE == VL53L0X_DataInit(&Dev))
        {
          Dev.Present = 1;
          SetupSingleShot(Dev);
        }
        else
        {
          printf("VL53L0X Time of Flight Failed to send its ID!\n");
        }
      }
    }
    else
    {
      printf("VL53L0X Time of Flight Failed to Initialize!\n");
    }
  }
  else
  {
    printf("VL53L0X Time of Flight Failed to get infos!\n");
  }
}

/**
  * @brief  Get distance from VL53L0X proximity sensor.
  * @retval Distance in mm
  */
static uint16_t VL53L0X_PROXIMITY_GetDistance(void)
{
  VL53L0X_RangingMeasurementData_t RangingMeasurementData;

  VL53L0X_PerformSingleRangingMeasurement(&Dev, &RangingMeasurementData);

  return RangingMeasurementData.RangeMilliMeter;
}

static void VL53L0X_PROXIMITY_MspInit(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /*Configure GPIO pin : VL53L0X_XSHUT_Pin */
  GPIO_InitStruct.Pin = VL53L0X_XSHUT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(VL53L0X_XSHUT_GPIO_Port, &GPIO_InitStruct);

  HAL_GPIO_WritePin(VL53L0X_XSHUT_GPIO_Port, VL53L0X_XSHUT_Pin, GPIO_PIN_SET);

  HAL_Delay(1000);
}


/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */

void controlla_valori_telefono(struct sharedValues_t *sv){

	uint8_t TxData[] = "STM32 : Hello!\n";
			int32_t ret;
			uint16_t Datalen;
			uint8_t  MAC_Addr[6];
			uint8_t  IP_Addr[4];

			int32_t Socket = -1;

			int16_t Trials = CONNECTION_TRIAL_MAX;
			char text[30];

			/*Initialize  WIFI module */
			  if(WIFI_Init() ==  WIFI_STATUS_OK)
			  {
				TERMOUT("> WIFI Module Initialized.\n");
				if(WIFI_GetMAC_Address(MAC_Addr) == WIFI_STATUS_OK)
				{
				  TERMOUT("> es-wifi module MAC Address : %X:%X:%X:%X:%X:%X\n",
						   MAC_Addr[0],
						   MAC_Addr[1],
						   MAC_Addr[2],
						   MAC_Addr[3],
						   MAC_Addr[4],
						   MAC_Addr[5]);
				}
				else
				{
				  TERMOUT("> ERROR : CANNOT get MAC address\n");
				  BSP_LED_On(LED2);
				}

				if( WIFI_Connect(SSID, PASSWORD, WIFI_ECN_WPA2_PSK) == WIFI_STATUS_OK)
				{
				  TERMOUT("> es-wifi module connected \n");
				  if(WIFI_GetIP_Address(IP_Addr) == WIFI_STATUS_OK)
				  {
					TERMOUT("> es-wifi module got IP Address : %d.%d.%d.%d\n",
						   IP_Addr[0],
						   IP_Addr[1],
						   IP_Addr[2],
						   IP_Addr[3]);

					TERMOUT("> Trying to connect to Server: %d.%d.%d.%d:%d ...\n",
						   RemoteIP[0],
						   RemoteIP[1],
						   RemoteIP[2],
						   RemoteIP[3],
										 RemotePORT);

					while (Trials--)
					{
					  if( WIFI_OpenClientConnection(0, WIFI_TCP_PROTOCOL, "TCP_CLIENT", RemoteIP, RemotePORT, 0) == WIFI_STATUS_OK)
					  {
						TERMOUT("> TCP Connection opened successfully.\n");
						Socket = 0;
						break;
					  }

					}
					if(Socket == -1)
					{
					  TERMOUT("> ERROR : Cannot open Connection\n");
					  BSP_LED_On(LED2);
					}
				  }
				  else
				  {
					TERMOUT("> ERROR : es-wifi module CANNOT get IP address\n");
					BSP_LED_On(LED2);
				  }
				}
				else
				{
				  TERMOUT("> ERROR : es-wifi module NOT connected\n");
				  BSP_LED_On(LED2);
				}
			  }
			  else
			  {
				TERMOUT("> ERROR : WIFI Module cannot be initialized.\n");
				BSP_LED_On(LED2);
			  }

			  while(1)
			  {
				 // osSemaphoreAcquire(primo, portMAX_DELAY);
				if(Socket != -1)
				{
				  ret = WIFI_ReceiveData(Socket, RxData, sizeof(RxData)-1, &Datalen, WIFI_READ_TIMEOUT);
				  if(ret == WIFI_STATUS_OK)
				  {
					if(Datalen > 0)
					{
					  RxData[Datalen]=0;
					  TERMOUT("Received: %s\n",RxData);
					  int ritorno = atoi(RxData);
					  if(ritorno==45){
						  ret = WIFI_SendData(Socket, TxData, sizeof(TxData), &Datalen, WIFI_WRITE_TIMEOUT);
					  }
					  if(ritorno == 50){
						  uint8_t TxData2[] = "Numero 50\n";
						  ret = WIFI_SendData(Socket, TxData2, sizeof(TxData2), &Datalen, WIFI_WRITE_TIMEOUT);
					  }

					  if(ritorno == 0){



						  //itoa ( sv->proximity, text, 10);
						  snprintf(text, 30, "Valore temperatura: %d \n", sv->proximity); // puts string into buffer


						  ret = WIFI_SendData(Socket, text, sizeof(text), &Datalen, WIFI_WRITE_TIMEOUT);


					  }
					  if(ritorno==1){
						  char msg[30] = "";

						  snprintf(text,30," TEMPERATURE = %d.%02d\n\r", sv->temperature_val1, sv->temperature_val2);
						  ret = WIFI_SendData(Socket, text, sizeof(text), &Datalen, WIFI_WRITE_TIMEOUT);

					  }

						  if (ret != WIFI_STATUS_OK)
					  {
						TERMOUT("> ERROR : Failed to Send Data, connection closed\n");
						break;
					  }
					}
				  }
				  else
				  {
					TERMOUT("> ERROR : Failed to Receive Data, connection closed\n");
					break;
				  }
				}
				 //osSemaphoreRelease(secondo);
			  }




}

/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *arguments)
{

	controlla_valori_telefono(&sharedValues);



}

/* USER CODE BEGIN Header_StartTask02 */
/**
* @brief Function implementing the myTask02 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTask02 */

void stampa(struct sharedValues_t *sv){
	 osSemaphoreAcquire(sv->secondo, portMAX_DELAY);
		printf("Thread 2\n");

		float temperature;
		float separa = 0;
		int val1,val2;
		char msg[30] = "";
		temperature = BSP_TSENSOR_ReadTemp();
		printf("Thread TTTTTTTTTTTTTTTTTTt\n");
		val1 = temperature;
		separa = temperature - val1;
		val2 = trunc(separa * 100);
		sv->temperature_val1 = val1;
		sv->temperature_val2 = val2;
		snprintf(msg,30," TEMPERATURE = %d.%02d\n\r", val1, val2);
		HAL_UART_Transmit(&huart1, (uint8_t*) msg, sizeof(msg), 1000);


  osSemaphoreRelease(sv->secondo);
  osDelay(500);
}
void StartTask02(void *arguments)
{
  /* USER CODE BEGIN StartTask02 */
  /* Infinite loop */
  for(;;)
  {

	  stampa(&sharedValues);
  }
  /* USER CODE END StartTask02 */
}

void aggiorna_contatore(struct sharedValues_t *sv){
	uint32_t ret = 0;
	uint16_t prox_value = 0;



	//prendo il mutex
	osSemaphoreAcquire(sv->primo, portMAX_DELAY);

	prox_value = VL53L0X_PROXIMITY_GetDistance();
	printf("DISTANCE is = %d mm \n", prox_value);
	//printf("DISTANCE is = %d mm \n", prox_value);
	sv->proximity = prox_value;

	osSemaphoreRelease(sv->primo);

