efenocchi/STM32-new_project/Core/Src/main.c
}

void Proximity_Test(void *arguments)
{

  printf("\n*************************************************************\n");
  printf("\n********************** Proximity Test ************************\n");
  printf("\n*************************************************************\n\n");
  VL53L0X_PROXIMITY_Init();

  while(1)
  {

	  	  aggiorna_contatore(&sharedValues);
	  	  HAL_Delay(1000);

  }

}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch (GPIO_Pin)
  {
    case (GPIO_PIN_1):
    {
      SPI_WIFI_ISR();
      break;
    }
    default:
    {
      break;
    }
  }
}

void SPI3_IRQHandler(void)
{
  HAL_SPI_IRQHandler(&hspi);
}
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
